In [1]:
import feedparser
import pandas as pd
from datetime import date, timedelta
from sqlalchemy import create_engine

engine = create_engine("sqlite:///c:\\ruby\\portlt\\db\\development.sqlite3")
conlt = engine.connect()

clean_path = "../data/clean/"
raw_path = "../data/raw/"
csv_path = "\\Users\\User\\iCloudDrive\\"
box_path = "\\Users\\User\\Dropbox\\"
one_path = "\\Users\\User\\OneDrive\\Documents\\Data\\"
pdf_path = "../PDF/"

pd.set_option('display.max_colwidth', 255)
pd.set_option('display.max_rows',None)
url = "https://feeds.feedburner.com/Setorth-form45-en"

today = date.today()
year = 2022
mmdd_str = today.strftime('%m%d')
mmdd_str

'1115'

In [2]:
#today = date(2022, 11, 11)
mmdd_str = today.strftime('%m%d')
mmdd_str

'1115'

In [3]:
rss_source = feedparser.parse(url)
f45_number = len(rss_source.entries)
print("Number of F45: ", f45_number)

Number of F45:  20

In [4]:
f45_items = []

for x in range(f45_number):
    f45_content = rss_source.entries[x]
    f45_item = {}
    
    print("\n----------------------------------\n")
    
    print("F45: " + str(x))
    title_ary = f45_content.title.partition(' ')
    f45_item['name'] = title_ary[0].strip() 
    print("Title: ", f45_item['name'])  
    f45_item['year'] = year
    print("Year: ", f45_item['year'])      
    qtr_ary = title_ary[2].partition(' (F45)')
    f45_item['quarter'] = qtr_ary[0][-1]    
    print("Quarter: ", f45_item['quarter'])    
    f45_item['link'] = f45_content.link
    print("Link: ", f45_item['link'])
    f45_item['published'] = f45_content.published
    print("Published: ", f45_item['published'])  
    f45_items.append(f45_item)

----------------------------------

F45: 0
Title:  SAFARI
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625113870
Published:  Tue, 15 Nov 2022 12:31:23 +0700

----------------------------------

F45: 1
Title:  POLY
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625107150
Published:  Tue, 15 Nov 2022 08:43:58 +0700

----------------------------------

F45: 2
Title:  POLY
Year:  2022
Quarter:  y
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625106850
Published:  Tue, 15 Nov 2022 08:42:29 +0700

----------------------------------

F45: 3
Title:  SCN
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625106750
Published:  Tue, 15 Nov 2022 08:40:54 +0700

----------------------------------

F45: 4
Title:  RAM
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625106380
Published:  Tue, 15 Nov 2022 08:39:28 +0700

----------------------------------

F45: 5
Title:  JKN
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625105710
Published:  Tue, 15 Nov 2022 08:34:18 +0700

----------------------------------

F45: 6
Title:  SABINA
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625105240
Published:  Tue, 15 Nov 2022 08:29:39 +0700

----------------------------------

F45: 7
Title:  CIG
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625105190
Published:  Tue, 15 Nov 2022 08:28:29 +0700

----------------------------------

F45: 8
Title:  TCC
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625104610
Published:  Tue, 15 Nov 2022 08:22:23 +0700

----------------------------------

F45: 9
Title:  KCC
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625104180
Published:  Tue, 15 Nov 2022 08:17:42 +0700

----------------------------------

F45: 10
Title:  SCI
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625103460
Published:  Tue, 15 Nov 2022 08:05:07 +0700

----------------------------------

F45: 11
Title:  SKY
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625103370
Published:  Tue, 15 Nov 2022 08:02:13 +0700

----------------------------------

F45: 12
Title:  TRU
Year:  2022
Quarter:  )
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625103060
Published:  Tue, 15 Nov 2022 07:52:30 +0700

----------------------------------

F45: 13
Title:  BYD
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625102820
Published:  Tue, 15 Nov 2022 07:48:36 +0700

----------------------------------

F45: 14
Title:  ACC
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625102780
Published:  Tue, 15 Nov 2022 07:48:14 +0700

----------------------------------

F45: 15
Title:  TNPC
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625101540
Published:  Tue, 15 Nov 2022 07:21:33 +0700

----------------------------------

F45: 16
Title:  TRITN
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625101010
Published:  Tue, 15 Nov 2022 06:56:42 +0700

----------------------------------

F45: 17
Title:  ALPHAX
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625100960
Published:  Tue, 15 Nov 2022 06:55:31 +0700

----------------------------------

F45: 18
Title:  IMH
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625099810
Published:  Tue, 15 Nov 2022 06:41:57 +0700

----------------------------------

F45: 19
Title:  SAFARI
Year:  2022
Quarter:  3
Link:  https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625099750
Published:  Tue, 15 Nov 2022 06:33:51 +0700

In [5]:
df = pd.DataFrame(f45_items)
df[['name','year','quarter','published']]

      name  year quarter                        published
0   SAFARI  2022       3  Tue, 15 Nov 2022 12:31:23 +0700
1     POLY  2022       3  Tue, 15 Nov 2022 08:43:58 +0700
2     POLY  2022       y  Tue, 15 Nov 2022 08:42:29 +0700
3      SCN  2022       3  Tue, 15 Nov 2022 08:40:54 +0700
4      RAM  2022       3  Tue, 15 Nov 2022 08:39:28 +0700
5      JKN  2022       3  Tue, 15 Nov 2022 08:34:18 +0700
6   SABINA  2022       3  Tue, 15 Nov 2022 08:29:39 +0700
7      CIG  2022       3  Tue, 15 Nov 2022 08:28:29 +0700
8      TCC  2022       3  Tue, 15 Nov 2022 08:22:23 +0700
9      KCC  2022       3  Tue, 15 Nov 2022 08:17:42 +0700
10     SCI  2022       3  Tue, 15 Nov 2022 08:05:07 +0700
11     SKY  2022       3  Tue, 15 Nov 2022 08:02:13 +0700
12     TRU  2022       )  Tue, 15 Nov 2022 07:52:30 +0700
13     BYD  2022       3  Tue, 15 Nov 2022 07:48:36 +0700
14     ACC  2022       3  Tue, 15 Nov 2022 07:48:14 +0700
15    TNPC  2022       3  Tue, 15 Nov 2022 07:21:33 +0700
16   TRITN  2022       3  Tue, 15 Nov 2022 06:56:42 +0700
17  ALPHAX  2022       3  Tue, 15 Nov 2022 06:55:31 +0700
18     IMH  2022       3  Tue, 15 Nov 2022 06:41:57 +0700
19  SAFARI  2022       3  Tue, 15 Nov 2022 06:33:51 +0700

In [6]:
df.groupby(['year','quarter']).count()

              name  link  published
year quarter
2022 )           1     1          1
     3          18    18         18
     y           1     1          1

In [7]:
df.loc[(df.quarter == 'S') ,['year','quarter']] = ['2022','3']
df.groupby(['year','quarter']).count()

              name  link  published
year quarter
2022 )           1     1          1
     1           1     1          1
     2           2     2          2
     3         225   225        225
     3           2     2          2

In [8]:
df.loc[(df.quarter == 'y') ,['year','quarter']] = ['2021','4']
df.groupby(['year','quarter']).count()

              name  link  published
year quarter
2022 3          18    18         18
2021 4           2     2          2

In [9]:
df.loc[(df.name == 'MC') ,['year','quarter']] = ['2023','1']
df.groupby(['year','quarter']).count()

              name  link  published
year quarter
2022 )           1     1          1
     2           1     1          1
     3         225   225        225
     3           3     3          3
2023 1           1     1          1

### After change all illogical quarters

In [9]:
df.quarter = df.quarter.astype(int)
df.groupby(['year','quarter']).count()

              name  link  published
year quarter
2022 3          18    18         18
2021 4           2     2          2

In [10]:
### First equals to latest published pdf file
df = df.drop_duplicates(subset='name', keep='first')
df.shape

(18, 5)

In [11]:
file_name = 'F45-RAW-' + mmdd_str + '.csv'
raw_file = raw_path + file_name
output_file = csv_path + file_name
box_file = box_path + file_name
one_file = one_path + file_name

df[['name','year','quarter','published']].to_csv(output_file, header=True, index=False, sep=',')
df[['name','year','quarter','published']].to_csv(box_file,    header=True, index=False, sep=',')
df[['name','year','quarter','published']].to_csv(one_file,    header=True, index=False, sep=',')
df[['name','year','quarter','published']].to_csv(raw_file,    header=True, index=False, sep=',')

In [12]:
sql = '''
SELECT *
FROM exempts
ORDER BY name'''
df_exempts = pd.read_sql(sql, conlt)
df_exempts.shape[0]

403

### Delete from exempts table

In [47]:
name = 'SABUY'
sqlDel = """
DELETE FROM exempts
WHERE name = '%s' """
sqlDel = sqlDel % name
print(sqlDel)

DELETE FROM exempts
WHERE name = 'SABUY'

In [48]:
rp = conlt.execute(sqlDel)
rp.rowcount

0

### End of delete from exempts table

In [13]:
df_merge = pd.merge(df, df_exempts, on='name', how='outer', indicator=True)
df_merge.shape

(411, 7)

### Tickers that are in Exempts table

In [14]:
in_exempts = df_merge.loc[
    df_merge['_merge'] == 'both',
    ['name','year','quarter','published','link']
    
]
in_exempts.year = in_exempts.year.astype(int)
in_exempts.quarter = in_exempts.quarter.astype(int)
in_exempts.sort_values(by=['published'],ascending=[False])

,name,year,quarter,published,link
2,SCN,2022,3,"Tue, 15 Nov 2022 08:40:54 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625106750
4,JKN,2022,3,"Tue, 15 Nov 2022 08:34:18 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625105710
5,SABINA,2022,3,"Tue, 15 Nov 2022 08:29:39 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625105240
6,CIG,2022,3,"Tue, 15 Nov 2022 08:28:29 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625105190
7,TCC,2022,3,"Tue, 15 Nov 2022 08:22:23 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625104610
9,SCI,2022,3,"Tue, 15 Nov 2022 08:05:07 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625103460
11,TRU,2021,4,"Tue, 15 Nov 2022 07:52:30 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625103060
13,ACC,2022,3,"Tue, 15 Nov 2022 07:48:14 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625102780
14,TNPC,2022,3,"Tue, 15 Nov 2022 07:21:33 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625101540
15,TRITN,2022,3,"Tue, 15 Nov 2022 06:56:42 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625101010

In [15]:
in_exempts.sort_values(by=['published'],ascending=[False]).shape[0]

10

### Not in exempts table

In [16]:
df_out = df_merge.loc[
    df_merge['_merge'] == 'left_only',
    ['name','year','quarter','published','link']
]
df_out.year = df_out.year.astype(int)
df_out.quarter = df_out.quarter.astype(int)
df_out.sort_values(by=['published'],ascending=[False])

,name,year,quarter,published,link
0,SAFARI,2022,3,"Tue, 15 Nov 2022 12:31:23 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625113870
1,POLY,2022,3,"Tue, 15 Nov 2022 08:43:58 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625107150
3,RAM,2022,3,"Tue, 15 Nov 2022 08:39:28 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625106380
8,KCC,2022,3,"Tue, 15 Nov 2022 08:17:42 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625104180
10,SKY,2022,3,"Tue, 15 Nov 2022 08:02:13 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625103370
12,BYD,2022,3,"Tue, 15 Nov 2022 07:48:36 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625102820
16,ALPHAX,2022,3,"Tue, 15 Nov 2022 06:55:31 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625100960
17,IMH,2022,3,"Tue, 15 Nov 2022 06:41:57 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625099810

In [17]:
#df_out = df_out.drop(df_out.index[df_out['name'] == "SCC"])
df_out.shape[0]

8

In [18]:
sql = '''
SELECT *
FROM tickers
ORDER BY name'''
df_tickers = pd.read_sql(sql, conlt)
df_tickers.shape

(401, 9)

In [19]:
df_merge2 = pd.merge(df_out, df_tickers, on='name', how='outer', indicator=True)
df_merge2.shape

(408, 14)

### There are no ticker records

In [20]:
df_merge2.loc[
    df_merge2['_merge'] == 'left_only',
    ['name','year','quarter','published','link']
]

,name,year,quarter,published,link
0,SAFARI,2022.0,3.0,"Tue, 15 Nov 2022 12:31:23 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625113870
1,POLY,2022.0,3.0,"Tue, 15 Nov 2022 08:43:58 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625107150
2,RAM,2022.0,3.0,"Tue, 15 Nov 2022 08:39:28 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625106380
3,KCC,2022.0,3.0,"Tue, 15 Nov 2022 08:17:42 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625104180
4,SKY,2022.0,3.0,"Tue, 15 Nov 2022 08:02:13 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625103370
5,BYD,2022.0,3.0,"Tue, 15 Nov 2022 07:48:36 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625102820
6,ALPHAX,2022.0,3.0,"Tue, 15 Nov 2022 06:55:31 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625100960

In [21]:
df_merge2.loc[
    df_merge2['_merge'] == 'left_only',
    ['name','year','quarter','published','link','id','market']
].shape

(7, 7)

### There are ticker records

In [22]:
df_out2 = df_merge2.loc[
    df_merge2['_merge'] == 'both',
    ['name','year','quarter','published','link','id','market']
]
df_out2

,name,year,quarter,published,link,id,market
7,IMH,2022.0,3.0,"Tue, 15 Nov 2022 06:41:57 +0700",https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625099810,730.0,mai

In [23]:
df_out2 = df_out2[df_out2.year.notnull()]
df_out2.shape

(1, 7)

In [24]:
df_out2['year'] = df_out2['year'].astype(int)
df_out2['quarter'] = df_out2['quarter'].astype(int)
df_out2.shape

(1, 7)

In [25]:
file_name = 'F45-CLEAN-' + mmdd_str + '.csv'
clean_file = clean_path + file_name
output_file = csv_path + file_name
box_file = box_path + file_name
one_file = one_path + file_name

df_out2[['name','year','quarter','published','market']].sort_values(['published'],ascending=[False]).to_csv(output_file, header=True, index=False, sep=',')
df_out2[['name','year','quarter','published','market']].sort_values(['published'],ascending=[False]).to_csv(clean_file, header=True, index=False, sep=',')
df_out2[['name','year','quarter','published','market']].sort_values(['published'],ascending=[False]).to_csv(box_file, header=True, index=False, sep=',')
df_out2[['name','year','quarter','published','market']].sort_values(['published'],ascending=[False]).to_csv(one_file, header=True, index=False, sep=',')

In [26]:
sql = '''
SELECT * 
FROM epss
WHERE year = 2022'''
df_epss = pd.read_sql(sql, conlt)
df_epss.shape

(677, 14)

In [27]:
df_merge3 = pd.merge(df_out2, df_epss, on=['name','year','quarter'], how='outer', indicator=True)
df_merge3.shape

(678, 19)

### Already input, display profit amt & eps to check with new F45

In [28]:
df_merge3[df_merge3['_merge'] == 'both']

Empty DataFrame
Columns: [name, year, quarter, published, link, id_x, market, id_y, q_amt, y_amt, aq_amt, ay_amt, q_eps, y_eps, aq_eps, ay_eps, ticker_id, publish_date, _merge]
Index: []

In [29]:
df_merge3[df_merge3['_merge'] == 'both'].shape

(0, 19)

### New F-45

In [30]:
df_inp2 = df_merge3[df_merge3['_merge'] == 'left_only']
df_inp3 = df_inp2.copy()
df_inp3.shape

(1, 19)

In [31]:
df_inp3['year'] = df_inp3['year'].astype(str)
df_inp3['quarter'] = df_inp3['quarter'].astype(str)
final = df_inp3.sort_values('name',ascending=True)
final_str = final.name+' '+final.year+' '+final.quarter+' '+final.link
final_str

0    IMH 2022 3 https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625099810
dtype: object

In [32]:
df_inp3_q3 = df_inp3[df_inp3['quarter'] == '3']
final_q3 = df_inp3_q3.sort_values('name',ascending=True)
final_str_q3 = final_q3.name+' '+final_q3.year+' '+final_q3.quarter+' '+final_q3.link
final_str_q3

0    IMH 2022 3 https://classic.set.or.th/set/newsdetails.do?language=en&country=US&newsId=16684625099810
dtype: object

In [33]:
df_inp3_q1 = df_inp3[df_inp3['quarter'] != '3']
final_q1 = df_inp3_q1.sort_values('name',ascending=True)
final_str_q1 = final_q1.name+' '+final_q1.year+' '+final_q1.quarter+' '+final_q1.link
final_str_q1

Series([], dtype: object)